ofcases/channel395/rans1d/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.10788896438434743; //10.56874;

boundaryField
{
    bottomWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    topWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    sides1_half0
    {
        type            cyclic;
    }
    sides2_half0
    {
        type            cyclic;
    }
    inout1_half0
    {
        type            cyclic;
//         type            turbulentMixingLengthFrequencyInlet;
//         mixingLength    0.1;
//         value           $internalField;
    }
    inout2_half0
    {
        type            cyclic;
//         type            turbulentMixingLengthFrequencyInlet;
//         mixingLength    1;
//         value           $internalField;
    }
    sides2_half1
    {
        type            cyclic;
    }
    sides1_half1
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
//         type            zeroGradient;


    }
    inout2_half1
    {
        type            cyclic;
//         type            zeroGradient;
    }
}

// ************************************************************************* //
