ofcases/channel395/rans1d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//     (0 0 0)
//     (0.05  0 0)
//     (0 0.03025 0)
//     (0.05  0.03025 0)
//     (0 0.0605 0)
//     (0.05  0.0605 0)
//     (0 0 0.1)
//     (0.05  0 0.1)
//     (0 0.03025 0.1)
//     (0.05  0.03025 0.1)
//     (0 0.0605 0.1)
//     (0.05 0.0605 0.1)

    (0 0 0)
    (0.1  0 0)
    (0 0.03025 0)
    (0.1  0.03025 0)
    (0 0.0605 0)
    (0.1  0.0605 0)
    (0 0 0.1)
    (0.1  0 0.1)
    (0 0.03025 0.1)
    (0.1  0.03025 0.1)
    (0 0.0605 0.1)
    (0.1 0.0605 0.1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8)    (1 40 1) simpleGrading (1 10.7028 1)
    hex (2 3 5 4 8 9 11 10)  (1 40 1) simpleGrading (1 0.0934 1)
//     hex (0 1 3 2 6 7 9 8)    (1 25 1) simpleGrading (1 10.7028 1)
//     hex (2 3 5 4 8 9 11 10)  (1 25 1) simpleGrading (1 0.0934 1)
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 1 7 6));
    }
    topWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }

    sides1_half0
    {
        type            cyclic;
        neighbourPatch  sides1_half1;
        faces           ((0 2 3 1));
    }
    sides1_half1
    {
        type            cyclic;
        neighbourPatch  sides1_half0;
        faces           ((6 7 9 8));
    }

    sides2_half0
    {
        type            cyclic;
        neighbourPatch  sides2_half1;
        faces           ((2 4 5 3));
    }
    sides2_half1
    {
        type            cyclic;
        neighbourPatch  sides2_half0;
        faces           ((8 9 11 10));
    }

    inout1_half0
    {
//         type            patch;
        type            cyclic;
        neighbourPatch  inout1_half1;
        faces           ((1 3 9 7));
    }
    inout1_half1
    {
//         type            patch;
        type            cyclic;
        neighbourPatch  inout1_half0;
        faces           ((0 6 8 2));
    }

    inout2_half0
    {
//         type            patch;
        type            cyclic;
        neighbourPatch  inout2_half1;
        faces           ((3 5 11 9));
    }
    inout2_half1
    {
//         type            patch;
        type            cyclic;
        neighbourPatch  inout2_half0;
        faces           ((2 8 10 4));
    }
);


// ************************************************************************* //
